#Создайте два множества: одно с чётными числами, другое с нечётными. Найдите их пересечение.
even =  [4,8,2,16,444,22]
odd = [1,5,31,753,45,9,17]
print(set(even).intersection(set(odd)))