#Даны два словаря. Объедините их в один
my_dict = {"a":"1", "b":"2", "c":"3", "d":"4", "e":"5"}
my_dict2 = {"g":"1", "h":"2", "i":"3", "j":"4", "k":"5"}
my_dict.update(my_dict2)
print(my_dict)